# Задание №1 Составить алгоритм: если введенное число больше 7, то вывести “Привет” 
```
import java.util.Scanner;

public class Main {

    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        System.out.println("Введите число:");
        int number = scanner.nextInt();
        if (number > 7) {
            System.out.println("Привет");
        }
    }
}
```
Задание 2 Составить алгоритм: если введенное имя совпадает с Вячеслав, то вывести “Привет, Вячеслав”, если нет, то вывести "Нет такого имени"

```
import java.util.Scanner;
public class Main {
   public static void main(String[] args) {
      Scanner scanner = new Scanner(System.in);
      System.out.println("Введите имя:");
      String имя = scanner.nextLine();
      if (имя.equalsIgnoreCase("Вячеслав")) {
         System.out.println("Привет, Вячеслав");
      } else {
         System.out.println("Нет такого имени");
      }
      scanner.close();
   }
}
```

Задание 3 Составить алгоритм: на входе есть числовой массив, необходимо вывести элементы массива кратные 3
```
public class Main {
   public static void main(String[] args) {
      // Шаг 2: создание и заполнение массива
      int[] массив = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 };

      // Шаг 3: проход по каждому элементу массива
      for (int i = 0; i < массив.length; i++) {
         // проверка, является ли элемент кратным 3
         if (массив[i] % 3 == 0) {
            // Шаг 3.1: вывод элемента на экран
            System.out.println(массив[i]);
         }
      }
   }
}
```
Задание 4 Дана скобочная последовательность: [((())()(())]]

а) Можно ли считать эту последовательность правильной? 

Нет, данная последовательность не является правильной. 
Правильная скобочная последовательность должна удовлетворять следующим условиям:
1. Количество открывающих и закрывающих скобок должно быть одинаковым.
2. Каждая открывающая скобка должна иметь соответствующую закрывающую скобку, и они должны совпадать по типу (круглые, квадратные, фигурные скобки).

б) Если ответ на предыдущий вопрос “нет”, то что необходимо в ней изменить, чтоб она стала правильной?

Необходимо добавить [ в самое начало,  и ) на третью позицию с конца


